In [3]:
import pandas as pd
import numpy as np
nparray = np.random.randint(1,30,size=(5,3))
df5=pd.DataFrame(nparray,columns=["s1","s2","s3"])
df5

   s1  s2  s3
0  29  29   4
1  13   2   6
2   2  26  25
3  15  11  24
4   6  22  11

In [5]:
df5["s2"]>15

0     True
1    False
2     True
3    False
4     True
Name: s2, dtype: bool

In [6]:
df5[df5["s2"]>15]

   s1  s2  s3
0  29  29   4
2   2  26  25
4   6  22  11

In [11]:
(df5["s2"]>15) & (df5["s1"]>15)

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [12]:
df5[(df5["s2"]>15) & (df5["s1"]>15)]

   s1  s2  s3
0  29  29   4

In [14]:
df5[(df5["s2"]>15) & (df5["s1"]>15)][["s1","s2"]]

   s1  s2
0  29  29